# AnalyticalNodeConnectionStatus Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalNodeConnectionStatus Property
ParameterTypeId Class See Also
---
"Connection Status"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalNodeConnectionStatus { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalNodeConnectionStatus As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalNodeConnectionStatus {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace